import React from "react";
import Typography from "@material-ui/core/Typography";
import {Container} from "@material-ui/core";
import useStyles from "./styles";

const AboutUs = () => {
    const classes = useStyles();

    return (
        <div className={classes.aboutUs}>
            <Container>
                <Typography variant="h5">
                    Навчальний заклад: Середино-Будська загальноосвітня школа І-ІІІ ступенів № 1 Середино-Будської районної ради.
                </Typography>
                <Typography variant="body1">
                    Рiк народження: 1934 р.<br />
                    Кількість учителів - 53 особи.<br />
                    Ліцензований обсяг  учнів - 700 осіб, навчається в закладі 401 учень.<br />
                    Мова освітнього процесу - українська.<br />
                    Має найкращий рейтинг серед шкіл Середино-Будського району протягом багатьох років.<br />
                    Опорна школа в районі з питань управлінської діяльності.<br />
                    Школа управлінської майстерності керівників закладів освіти району.<br />
                    Школа педагогічної майстерності вчителів із базових дисциплін.<br />
                    Школа з високим показником участі у Всеукраїнських учнівських олімпіадах з базових дисциплін.
                </Typography>
                <Typography variant="body1">
                    Слід відзначити, що із 50 педагогічних працівників школи 50 мають вищу педагогічну освіту, 23 - вищу кваліфікаційну категорію, 2 - звання «учитель-методист», 10 - звання «старший учитель», 1 - «Заслужений учитель України», 9 педагогів нагороджено знаком «Відмінник освіти України».
                    Звичайно, статистичні дані мало про що можуть сказати. У навчально-виховній роботі набирає значущості дух закладу, який живе не в стінах, не на папері, а в характері педагогів і від них переходить до характеру вихованців. Тому так важливо плекати особистість учителя навчального закладу, від якого залежить реалізація стратегії навчання та виховання.
                    Успіх діяльності навчального закладу зумовлюється позицією директора, стилем його роботи, компетентністю, рівнем стосунків із людьми. Директор володіє вмінням відчувати й розуміти шкільне життя в усіх його різноманітних проявах, майстерно встановлює причинно-наслідкові зв'язки між подіями й змінами, що відбуваються в школі, об'єктивно оцінює й узагальнює явища та факти педагогічної діяльності. На цій основі приймає управлінські рішення, здійснює творчий підхід до вирішення внутрішньо- шкільних проблем.
                    Значних зусиль директор докладає, щоб сприяти самоствердженню вчителя, учня, сім'ї на рівні колективу школи, міста, області, держави.
                </Typography>
                <Typography variant="body1">
                    Сьогодні змінюється уявлення про учня, учителя, навчальний процес, керівника закладу, тому директор разом зі своїми заступниками використовує в роботі сучасні тенденції освітнього менеджменту, такі як:
                    <ul>
                        <li>відмова від авторитарного стилю управління й перехід до партнерства, демократії;</li>
                        <li>делегування повноважень;</li>
                        <li>організовує педагогічний колектив за принципом «ми всі робимо одну справу»;</li>
                        <li>постійне самовдосконалення.</li>
                    </ul>
                </Typography>
                <Typography variant="h5">МАТЕРІАЛЬНО –ТЕХНІЧНА БАЗА</Typography>
                <Typography variant="body1">Сучасна Середино-Будська загальноосвітня школа І-ІІІ ступенів №1 - це дві двоповерхові споруди загальною плошею 4723 м2 з 28 класними кімнатами і навчальними кабінетами (загальна поща 1445 м2): хімії, фізики, математики, іноземної мови, біології, української мови, географії, історії. Обладнані комп’ютерною технікою 2 кабінети інформатики з 33 комп’ютерами, є бібліотека, дві навчально-виробничі майстерні, спортивний та актовий зали, спортивний майданчик, їдальня (126 посадочних місць), внутрішній та зовнішній туалет для учнів. Для дотримання температурного режиму у 2015 році було реконстуйовано твердопаливну котельню. Є і газова котельня. Придбано нові меблі для 6 класних кімнат старшої школи, оснащено мультимедійними комплексами кабінети математики, фізики, біології, хімії, іноземної мови, інформатики. У початковій школі оснащено 2 кабінети для 2-х та 2 кабінети для 1-х класів згідно Нових освітніх стандартів Нової української школи.</Typography>

                <Typography variant="body1">Наш заклад доступний для навчання осіб з особливими освітніми потребами - є пандус. На території школи з вересня 2018 року працює Комунальна установа "Середино-Будський інклюзивно-ресурсний центр" Середино-Будської районної ради Сумської області.</Typography>

            </Container>
        </div>
    );
};

export default AboutUs;
